# Створіть список випадкових чисел із випадковою кількістю елементів від 3 до 10.
#
# Ваше завдання - створити новий список з 3 елементів початкового списку - першим, третім і другим з кінця.
#
# Приклад:
#
#
#
# [1, 2, 3, 4, 5, 6, 7, 9] == [1, 3, 7]
# [1, 1, 2, 1] == [1, 2, 2]
# [6, 3, 7] == [6, 7, 3]



# Список для обработки
lists = [
    [1, 2, 3, 4, 5, 6, 7, 9],
    [1, 1, 2, 1],
    [6, 3, 7]
]

# Обработка каждого списка
for original_list in lists:
    # Формирование нового списка( из lists в original_lists)
    new_list = [original_list[0], original_list[2], original_list[-2]]
    # new_list=[original_list[0] вывод первого числа,[original_list[2]-вывод каждого 3 числа,
    #[original_list[-2] вывод числа второго с конца

    # Вывод результата
    print(f"Было: {original_list} -> Стало: {new_list}")
